app/controllers/animes_controller.rb

INSERT INTO "animes" ("english_title", "romanji_title", "start_air_date", "end_air_date", "number_of_episodes", "description", "season", "studio", "source", "duration", "age_rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
        anime = Anime.new(anime_params)

        if anime.save

SELECT "animes".* FROM "animes"
---
  def index
    render json: AnimeBlueprint.render(Anime.all, view: :top_anime), status: :ok

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
def add_genres

  genre_ids = JSON.parse(request.body.read)['genre_ids']

  genre_ids.each do |genre_id|
    genre = Genre.find(genre_id)

SELECT "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def set_anime
    @anime = Anime.find(params[:id])