app/controllers/anime_lists_controller.rb

  def show
    @user = User.find_by(username: params[:username])
    @anime_list = AnimeList.where(user_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "darlena"], ["LIMIT", 1]]
SELECT "anime_lists".* FROM "anime_lists" WHERE "anime_lists"."user_id" = ?  [["user_id", 41]]
SELECT "users".* FROM "users" WHERE "users"."user_id" = ?  [["user_id", 1]]

  def create

    @anime_list = AnimeList.new(anime_list_params)

    if @anime_list.save
---
INSERT INTO "anime_lists" ("anime_id", "user_id", "created_at", "updated_at", "list_type", "start_date", "end_date", "episodes_watched") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    anime_list = AnimeList.find(params[:id])
    anime_list.destroy if anime_list
---
SELECT "anime_lists".* FROM "anime_lists" WHERE "anime_lists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "anime_lists" WHERE "anime_lists"."id" = ?  [["id", 12]]