app/controllers/animes_controller.rb

SELECT "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_anime
    @anime = Anime.find(params[:id])