app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def authenticate_request
        header = request.headers['Authorization']
        header = header.split(' ').last if header


    begin

        decoded = JWT.decode(header,Rails.application.credentials.secret_key_base).first

        @current_user = User.find(decoded["user_id"])