app/controllers/cast_and_crew_controller.rb

INSERT INTO "cast_and_crews" ("anime_id", "person_id", "role", "character", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["anime_id", 21], ["person_id", 1], ["role", "Voice Actor"], ["character", "Spike Spiegal"], ["created_at", "2024-04-08 22:57:15.130205"], ["updated_at", "2024-04-08 22:57:15.130205"]]
---
  def create
    cast = CastAndCrew.new(cast_params)

    if cast.save