app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "dobber"], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "bio", "profile_picture", "created_at", "updated_at", "favorites") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["bio", nil], ["profile_picture", nil], ["created_at", "2024-04-09 04:04:38.605120"], ["updated_at", "2024-04-09 04:04:38.605120"], ["favorites", nil]]
---
  def set_profile


    user = User.find_by(username: params[:username])

  if user
    @profile = user.profile || user.create_profile