app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "anime_id", "content", "created_at", "updated_at", "recommend") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 49], ["anime_id", 15], ["content", "test"], ["created_at", "2024-04-04 23:58:50.150288"], ["updated_at", "2024-04-04 23:58:50.150288"], ["recommend", 0]]
---
  def create
      review = Review.new(review_params)

      if review.save