app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "test"], ["email", "tester@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-03-11 03:27:52.619397"], ["updated_at", "2024-03-11 03:27:52.619397"]]
---
  def create
    user = User.new(user_params)
    if user.save