app/models/user.rb

    def create_default_profile
        self.create_profile(bio: 'Default bio')
---
INSERT INTO "profiles" ("user_id", "bio", "profile_picture", "created_at", "updated_at", "favorites") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 49], ["bio", "Default bio"], ["profile_picture", nil], ["created_at", "2024-03-11 03:27:52.662521"], ["updated_at", "2024-03-11 03:27:52.662521"], ["favorites", nil]]